### Урок 5.6: операции над датафреймами – часть 2

In [1]:
import pandas as pd
df = pd.DataFrame([['Anna', 23, 3],
             ['Sam', 36, 12],
             ['Bill', 33, 10],
             ['Moica', 25, 7],
             ['Lisa', 27, 7],
             ['Peter', 32, None]])
df.columns = ['name', 'age', 'expr']  
df = df.dropna()

### Создание новых столбцов

Добавим столбец `age_sq`, содержащий значения возраста респондентов, возведенные в квадрат:

In [2]:
df['age_sq'] = df['age'] ** 2
df

    name  age  expr  age_sq
0   Anna   23   3.0     529
1    Sam   36  12.0    1296
2   Bill   33  10.0    1089
3  Moica   25   7.0     625
4   Lisa   27   7.0     729

Сначала указывается название нового столбца в квадратных скобках, затем описывам те операции, которые необходимо выполнить со старым столбцом. Можно создать новый столбец на основе двух (и более) старых. Создадим столбец `no_work`, в котором будет сохранено число лет, которое люди не работали (возраст за вычетом лет опыта работы).

In [3]:
df['no_work'] = df['age'] - df['expr']
df

    name  age  expr  age_sq  no_work
0   Anna   23   3.0     529     20.0
1    Sam   36  12.0    1296     24.0
2   Bill   33  10.0    1089     23.0
3  Moica   25   7.0     625     18.0
4   Lisa   27   7.0     729     20.0

Можно создать столбец с нуля, например, столбец, состоящий из одного значения (возьмем `W` как статус человека – в трудоспособном возрасте):

In [4]:
df['status'] = 'W'  # из одного значения
df

    name  age  expr  age_sq  no_work status
0   Anna   23   3.0     529     20.0      W
1    Sam   36  12.0    1296     24.0      W
2   Bill   33  10.0    1089     23.0      W
3  Moica   25   7.0     625     18.0      W
4   Lisa   27   7.0     729     20.0      W

Или столбец из списка значений (столбец `gender`, пол):

In [5]:
df['gender'] = [0, 1, 1, 0, 0]  # из списка значений
df

    name  age  expr  age_sq  no_work status  gender
0   Anna   23   3.0     529     20.0      W       0
1    Sam   36  12.0    1296     24.0      W       1
2   Bill   33  10.0    1089     23.0      W       1
3  Moica   25   7.0     625     18.0      W       0
4   Lisa   27   7.0     729     20.0      W       0